import {g, h, v, l, type Hieroglyphs} from "$lib/word/egyptian/hieroglyphs"

const Important: [Hieroglyphs, string][] = [
	[g("𓏭"), "𓇌"],
	[g("𓏥"), "𓅱"],
	[g("𓏲"), "𓅱"],
	[g("𓀀"), "𓇋"],
	[g("𓂜"), "𓈖"],
	[v(g("𓂜"), g("𓈖")), "𓈖𓈖"],
	[v(g("𓍿"), g("𓈖"), g("𓏥")), "𓍿𓈖"],
	[v(g("𓏏"), g("𓈖"), g("𓏥")), "𓏏𓈖"],
	[h(g("𓋴"), v(g("𓈖"), g("𓏥"))), "𓋴𓈖"],
	[v(g("𓊃"), g("𓈖"), g("𓏥")), "𓊃𓈖"],
	[v(g("𓏌"), g("𓎡")), "𓇋𓈖𓎡"],
	[v(g("𓈖"), g("𓏏"), g("𓎡")), "𓈖𓏏𓎡"],
	[v(g("𓈖"), g("𓏏"), g("𓍿")), "𓈖𓏏𓍿"],
	[v(g("𓈖"), g("𓏏"), g("𓆑")), "𓈖𓏏𓆑"],
	[h(v(g("𓈖"), g("𓏏")), g("𓋴")), "𓈖𓏏𓋴"],
	[h(g("𓇋"), g("𓀁"), v(g("𓈖"), g("𓈖"), g("𓏥"))), "𓇋𓈖𓈖"],
	[h(v(g("𓈖"), g("𓏏")), v(g("𓍿"), g("𓈖"), g("𓏥"))), "𓈖𓏏𓍿𓈖"],
	[h(v(g("𓈖"), g("𓏏")), g("𓋴"), v(g("𓈖"), g("𓏥"))), "𓈖𓏏𓋴𓈖"],
	[v(g("𓎟"), g("𓇾"), g("𓇾")), "𓈖𓃀𓏏𓄿𓅱𓇌"],
	[g("𓊻"), "𓄡𓂋𓇌𓏏𓈖𓍿𓂋"],

	[h(g("𓇋"), g("𓅱")), "𓇋𓅱"],
	[g("𓆖"), "𓆓𓏏"],
	[l(g("𓆓"), g("𓋴")), "𓆓𓋴"],
	[l(g("𓆓"), g("𓂧")), "𓆓𓂧"],
	[l(g("𓅭"), g("𓇳")), "𓊃𓄿𓂋𓂝"],

	[g("𓋔"), "𓈖"],
	[g("𓅃"), "𓎛𓂋"],
]

export default Important
